In [5]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a' : 10, 'b' : 20, 'c' : 30}

In [3]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [9]:
d

{'a': 10, 'b': 20, 'c': 30}

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(data = [sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [15]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [17]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [25]:
ser2 = pd.Series([1,2,5,4],['USA', 'Germany','Italy', 'Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [27]:
ser3 = pd.Series(data = labels)

In [29]:
ser3

0    a
1    b
2    c
dtype: object

In [31]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [33]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [53]:
from numpy.random import randn
np.random.seed(101)

In [9]:
df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [11]:
df

          W         X         Y         Z
A -1.347941  0.023939  0.857593 -0.085585
B  1.586830 -0.846043  0.768124  0.727778
C -0.817866  0.484254  1.126709  0.187040
D  1.146848 -0.481332 -1.846238 -0.257750
E -0.965909 -0.418601  0.632689  1.537824

In [13]:
df['W']

A   -1.347941
B    1.586830
C   -0.817866
D    1.146848
E   -0.965909
Name: W, dtype: float64

In [15]:
type(df['W'])

pandas.core.series.Series

In [17]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df.W

A   -1.347941
B    1.586830
C   -0.817866
D    1.146848
E   -0.965909
Name: W, dtype: float64

In [21]:
df[['W', 'Z']]

          W         Z
A -1.347941 -0.085585
B  1.586830  0.727778
C -0.817866  0.187040
D  1.146848 -0.257750
E -0.965909  1.537824

In [23]:
df['new'] = df['W'] + df['Y']

In [25]:
df

          W         X         Y         Z       new
A -1.347941  0.023939  0.857593 -0.085585 -0.490348
B  1.586830 -0.846043  0.768124  0.727778  2.354954
C -0.817866  0.484254  1.126709  0.187040  0.308843
D  1.146848 -0.481332 -1.846238 -0.257750 -0.699389
E -0.965909 -0.418601  0.632689  1.537824 -0.333220

In [29]:
df.drop('new', axis = 1, inplace = True)

In [31]:
df

          W         X         Y         Z
A -1.347941  0.023939  0.857593 -0.085585
B  1.586830 -0.846043  0.768124  0.727778
C -0.817866  0.484254  1.126709  0.187040
D  1.146848 -0.481332 -1.846238 -0.257750
E -0.965909 -0.418601  0.632689  1.537824

In [33]:
df.drop('E')

          W         X         Y         Z
A -1.347941  0.023939  0.857593 -0.085585
B  1.586830 -0.846043  0.768124  0.727778
C -0.817866  0.484254  1.126709  0.187040
D  1.146848 -0.481332 -1.846238 -0.257750

In [35]:
df.shape

(5, 4)

In [37]:
df[['Z', 'Y']]

          Z         Y
A -0.085585  0.857593
B  0.727778  0.768124
C  0.187040  1.126709
D -0.257750 -1.846238
E  1.537824  0.632689

In [39]:
df.loc['A']

W   -1.347941
X    0.023939
Y    0.857593
Z   -0.085585
Name: A, dtype: float64

In [41]:
df.iloc[2]

W   -0.817866
X    0.484254
Y    1.126709
Z    0.187040
Name: C, dtype: float64

In [43]:
df.loc['B','Y']

0.7681238117782255

In [45]:
df

          W         X         Y         Z
A -1.347941  0.023939  0.857593 -0.085585
B  1.586830 -0.846043  0.768124  0.727778
C -0.817866  0.484254  1.126709  0.187040
D  1.146848 -0.481332 -1.846238 -0.257750
E -0.965909 -0.418601  0.632689  1.537824

In [49]:
df.loc[['A', 'B'],['W', 'Y']]

          W         Y
A -1.347941  0.857593
B  1.586830  0.768124

In [55]:
df[df > 0]

          W         X         Y         Z
A       NaN  0.023939  0.857593       NaN
B  1.586830       NaN  0.768124  0.727778
C       NaN  0.484254  1.126709  0.187040
D  1.146848       NaN       NaN       NaN
E       NaN       NaN  0.632689  1.537824

In [57]:
df['W'] > 0

A    False
B     True
C    False
D     True
E    False
Name: W, dtype: bool

In [59]:
df[df['W'] > 0]

          W         X         Y         Z
B  1.586830 -0.846043  0.768124  0.727778
D  1.146848 -0.481332 -1.846238 -0.257750

In [61]:
df

          W         X         Y         Z
A -1.347941  0.023939  0.857593 -0.085585
B  1.586830 -0.846043  0.768124  0.727778
C -0.817866  0.484254  1.126709  0.187040
D  1.146848 -0.481332 -1.846238 -0.257750
E -0.965909 -0.418601  0.632689  1.537824

In [75]:
df[df['Z'] > 0]

          W         X         Y         Z
B  1.586830 -0.846043  0.768124  0.727778
C -0.817866  0.484254  1.126709  0.187040
E -0.965909 -0.418601  0.632689  1.537824

In [67]:
resultDf = df[df['W'] > 0]

In [69]:
resultDf

          W         X         Y         Z
B  1.586830 -0.846043  0.768124  0.727778
D  1.146848 -0.481332 -1.846238 -0.257750

In [71]:
resultDf['X']

B   -0.846043
D   -0.481332
Name: X, dtype: float64

In [77]:
df[df['W'] > 0] [['Y', 'X']]

          Y         X
B  0.768124 -0.846043
D -1.846238 -0.481332

In [79]:
boolser = df['W'] > 0

In [81]:
boolser

A    False
B     True
C    False
D     True
E    False
Name: W, dtype: bool

In [83]:
result = df[boolser]

In [85]:
mycols = ['Y', 'X']

In [87]:
result[mycols]

          Y         X
B  0.768124 -0.846043
D -1.846238 -0.481332

In [91]:
df[(df['W'] > 0) & (df['Y'] > 0)]

         W         X         Y         Z
B  1.58683 -0.846043  0.768124  0.727778

In [93]:
df[(df['W'] > 0) | (df['Y'] > 0)]

          W         X         Y         Z
A -1.347941  0.023939  0.857593 -0.085585
B  1.586830 -0.846043  0.768124  0.727778
C -0.817866  0.484254  1.126709  0.187040
D  1.146848 -0.481332 -1.846238 -0.257750
E -0.965909 -0.418601  0.632689  1.537824

In [97]:
# Yukarıdaki örnekler için or veya and operatörleri kullanılamaz sadece örnekteki gibi kullanım
# legal bir kullanım olarak kabul edilir.

In [99]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.347941  0.023939  0.857593 -0.085585
1     B  1.586830 -0.846043  0.768124  0.727778
2     C -0.817866  0.484254  1.126709  0.187040
3     D  1.146848 -0.481332 -1.846238 -0.257750
4     E -0.965909 -0.418601  0.632689  1.537824

In [101]:
df

          W         X         Y         Z
A -1.347941  0.023939  0.857593 -0.085585
B  1.586830 -0.846043  0.768124  0.727778
C -0.817866  0.484254  1.126709  0.187040
D  1.146848 -0.481332 -1.846238 -0.257750
E -0.965909 -0.418601  0.632689  1.537824

In [103]:
newind = "CA NY LA NJ OR".split()

In [105]:
newind

['CA', 'NY', 'LA', 'NJ', 'OR']

In [107]:
df['States'] = newind

In [109]:
df

          W         X         Y         Z States
A -1.347941  0.023939  0.857593 -0.085585     CA
B  1.586830 -0.846043  0.768124  0.727778     NY
C -0.817866  0.484254  1.126709  0.187040     LA
D  1.146848 -0.481332 -1.846238 -0.257750     NJ
E -0.965909 -0.418601  0.632689  1.537824     OR

In [111]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.347941  0.023939  0.857593 -0.085585
NY      1.586830 -0.846043  0.768124  0.727778
LA     -0.817866  0.484254  1.126709  0.187040
NJ      1.146848 -0.481332 -1.846238 -0.257750
OR     -0.965909 -0.418601  0.632689  1.537824

In [113]:
df

          W         X         Y         Z States
A -1.347941  0.023939  0.857593 -0.085585     CA
B  1.586830 -0.846043  0.768124  0.727778     NY
C -0.817866  0.484254  1.126709  0.187040     LA
D  1.146848 -0.481332 -1.846238 -0.257750     NJ
E -0.965909 -0.418601  0.632689  1.537824     OR

In [115]:
#Index Levels
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [117]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [119]:
inside

[1, 2, 3, 1, 2, 3]

In [121]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [125]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [127]:
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

In [129]:
df.loc['G1']

          A         B
1  2.706850  0.628133
2  0.907969  0.503826
3  0.651118 -0.319318

In [131]:
df.index.names = ['Groups', 'Num']

In [133]:
df

                   A         B
Groups Num
G1     1    2.706850  0.628133
       2    0.907969  0.503826
       3    0.651118 -0.319318
G2     1   -0.848077  0.605965
       2   -2.018168  0.740122
       3    0.528813 -0.589001

In [137]:
df.loc['G2'].loc[2]['B']

0.7401220570561068

In [139]:
df.loc['G1']

            A         B
Num
1    2.706850  0.628133
2    0.907969  0.503826
3    0.651118 -0.319318

In [141]:
# Num = 1 de bulunan dataları alma
df.xs(1, level = 'Num')

               A         B
Groups
G1      2.706850  0.628133
G2     -0.848077  0.605965

In [143]:
#Missing Data

In [157]:
d = {'A' : [1,2,np.nan], 'B': [5,np.nan, np.nan], 'C':[1,2,3]}

In [159]:
df = pd.DataFrame(d)

In [161]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [163]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [165]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [167]:
df.fillna(value = 'Default Value')

               A              B  C
0            1.0            5.0  1
1            2.0  Default Value  2
2  Default Value  Default Value  3

In [169]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [171]:
# Yukarıdaki örneklerde dropna ve fillna metotlarından bahsedilmiştir.

In [173]:
# Groupby

In [175]:
data = {'Company' : ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales': [200, 120, 340, 124, 243, 350]}

In [177]:
df = pd.DataFrame(data)

In [179]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350